Repository: fbrehm/py_pb_dbhandler
Catalog: po/py_pb_dbhandler.*.po
Languages: de

source: Destroying base database object.
de: Zerstöre Datenbankobjekt.

source: Error performing .pgpass file, using empty password: %s
de: Fehler bei der Verabeitung der .pgpass-Datei, verwende leeres Passwort: %s

source: Trying to establish a connection while an existing database connection.
de: Versuche eine Datenbankverbindung einzurichten, während schon eine existiert.

source: Used parameters to connect to database:
de: Verwendete Parameter für die Datenbankverbindung:

source: Setting DB connection to readonly.
de: Setze die Datenbnk-Verbindung auf nur-lesend.

source: DB connection: %r
de: Datenbankverbindung: %r

source: DB connection closed.
de: Datenbankverbindung geschlossen.

source: DB connection opened.
de: Datenbankverbindung geöffnet.

source: DB cursor: %r
de: Datenbankcursor: %r

source: Not connected to database.
de: Nicht mit der Datenbank verbunden.

source: Opening database cursor.
de: Öffne Datenbankcursor.

source: Closing database cursor.
de: Schließe Datenbankcursor.

source: Closing the database connection.
de: Schließe Datenbankverbindung.

source: Destroying db connection object.
de: Zerstöre Datenbankverbindungsobjekt.

source: The port number of a PostgreSQL database must be greater than zero.
de: Die Portnummer einer PostgreSQL-Datenbank muss größer als Null sein.

source: The port number of a PostgreSQL database must be less or equal %d.
de: Die Portnummer einer PostgreSQL-Datenbank muss kleiner oder gleich %d sein.

source: Database options
de: Datenbankoptinen

source: The host of the PostgreSQL database (Default: %r).
de: Der Hostname der PostgreSQL-Datenbank (Vorgabe: %r).

source: The TCP port of PostgreSQL database on the database machine (Default: %d).
de: Die Portnummer der PostgreSQL-Datenbank auf dem Datenbankserver (Vorgabe: %d).

source: The database schema (database) used on DB host.
de: Das Datenbankschema (die Datenbank) auf dem Datenbankserver.

source: The database schema (database) used on DB host (Default: %r).
de: Das Datenbankschema (die Datenbank) auf dem Datenbankserver (Vorgabe: %r).

source: The database user using for connecting to DB.
de: Der Datenbanknutzer, der für die Verbindung zur Datenbank verwendet wird.

source: The database user using for connecting to DB (Default: %r).
de: Der Datenbanknutzer, der für die Verbindung zur Datenbank verwendet wird (Vorgabe: %r).

source: The password of the database user connecting to DB.
de: Das Paßwort des Datenbanknutzers.

source: The usage of this parameter is not recommended.
de: Die Verwendung dieser Option wird nicht empfohlen.

source: Better use an appropriate entry in the $HOME/.pgpass file.
de: Verwenden Sie besser einen entspechenden Eintrag in der $HOME/.pgpass Datei.

source: Environment variable %r not set.
de: Umgebungsvariable %r nicht gesetzt.

source: Pgpassfile %r doesn't exists.
de: Pgpass-Datei %r existiert nicht.

source: Pgpassfile %r is not readable.
de: Pgpass-Datei %r ist nicht lesbar.

source: Others have permissions on %r.
de: Andere (others) haben Rechte auf %r.

source: Group has permissions on %r.
de: Die Gruppe hat Rechte auf %r.

source: Group and others have permissions on %r.
de: Die Gruppe und andere (others) haben Rechte auf %r.

source: No valid content in %r found.
de: Ungültigen Inhalt in %r gefunden.

source: Got fields: %r
de: Erhaltene Felder: %r

source: Invalid entry %(entry)r in %(file)r line %(rownum)d found, only %(nr)d fields found instead of 5.
de: Ungültigen Eintrag %(entry)r in %(file)r, Zeile %(rownum)d, gefunden, nur %(nr)d Felder anstelle von fünf Feldern gefunden.

source: Invalid port %(port)r in %(file)r line %(rownum)d found.
de: Ungültigen Port %(port)r in %(file)r, Zeile %(rownum)d, gefunden.

source: Found entries in %(file)r: %(list)s
de: Gefundene Einträge in %(file)r: %(list)s

source: Password found for host %(host)r, port %(port)d, database %(db)r and user %(usr)r.
de: Passwort für Host %(host)r, Port %(port)d, Datenbank %(db)r und Nutzer %(usr)r gefunden.

source: No password found for host %(host)r, port %(port)d, database %(db)r and user %(usr)r.
de: Kein Passwort für Host %(host)r, Port %(port)d, Datenbank %(db)r und Nutzer %(usr)r gefunden.

source: Basedir: %r
de: Basis-Verzeichnis: %r

source: Found .mo-file: %r
de: Gefundene .mo-Datei: %r
